`timescale 1ns / 1ps

module instruction_mem (
    input  logic [31:0] instr_addr,
    output logic [31:0] instr_code
);
    logic [31:0] instr_rom[0:127]; 
`ifdef  TEST_SIMULATION
    initial begin
        // =========================================================================
        // 1. U-TYPE 검증 구간
        // =========================================================================
        // [PC: 0x00] LUI x1, 0x12345 
        // 목표: x1에 32'h12345000 저장
        instr_rom[0]  = 32'h123450b7; 

        // [PC: 0x04] AUIPC x2, 0x00010
        // 목표: x2에 (현재 PC 0x04 + 0x00010000) = 32'h00010004 저장
        // [수정 완료] 상위 20비트 자리에 정확히 0x00010이 오도록 16진수 배치 수정
        instr_rom[1]  = 32'h00010117; 


        // =========================================================================
        // 2. J-TYPE (정방향 점프) 검증 구간
        // =========================================================================
        // [PC: 0x08] JAL x3, 16 (offset = +16) -> 오프셋 바이트 수 기준 계산
        // 동작: PC + 16인 0x18로 점프. x3에는 복귀 주소인 PC + 4 (0x0C) 저장
        instr_rom[2]  = 32'h010001ef; 


        // =========================================================================
        // 3. 데드 코드 구간 (점프 성공 시 하드웨어가 절대 진입하지 않아야 함)
        // =========================================================================
        // JAL 분기가 성공하면 이 주소들(0x0C, 0x10)은 건너뛰어야 합니다.
        instr_rom[3]  = 32'hfff00213; // [PC: 0x0C] ADDI x4, x0, -1 
        instr_rom[4]  = 32'hfff00293; // [PC: 0x10] ADDI x5, x0, -1 


        // =========================================================================
        // 4. J-TYPE 역방향 점프의 목적지 및 무한 루프 대기소
        // =========================================================================
        // [PC: 0x14] JAL x0, 0
        // 동작: 0x18에서 역방향 점프로 도달한 후, 최종적으로 자기 자신에게 점프하며 홀딩.
        instr_rom[5]  = 32'h0000006f; 


        // =========================================================================
        // 5. J-TYPE (역방향 음수 점프) 검증 구간
        // =========================================================================
        // [PC: 0x18] JAL x7, -4 (offset = -4)
        // 동작: 0x08에서 날아온 도착점. PC - 4인 0x14로 역방향 점프 수행.
        // x7에는 복귀 주소인 PC + 4 (0x1C) 저장.
        instr_rom[6]  = 32'hffdf_f3ef; 





        // 나머지 메모리 공간 0으로 초기화 (NOP)
        for (int i = 7; i < 64; i++) begin
            instr_rom[i] = 32'h0000_0000;
        end
    end
`endif
    initial begin
      $readmemh("instruction_mem_sort.mem",instr_rom);
    end

    // 주소 하위 2비트 버림(Word Alignment) 처리하여 ROM 인덱싱
    assign instr_code = instr_rom[instr_addr[31:2]];

endmodule